name: "JointAndImageStateRegressionNet"
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_a"
  top: "rgb_frames_a"
  hdf5_data_param {
    source: "examples/vgps/train_pose_a.txt"
    batch_size: 25
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_a"
  top: "rgb_frames_a"
  hdf5_data_param {
    source: "examples/vgps/val_pose_a.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-val'
  }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_b"
  top: "rgb_frames_b"
  hdf5_data_param {
    source: "examples/vgps/train_pose_b.txt"
    batch_size: 25
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_b"
  top: "rgb_frames_b"
  hdf5_data_param {
    source: "examples/vgps/val_pose_b.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-val'
  }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_c"
  top: "rgb_frames_c"
  hdf5_data_param {
    source: "examples/vgps/train_pose_c.txt"
    batch_size: 25
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_c"
  top: "rgb_frames_c"
  hdf5_data_param {
    source: "examples/vgps/val_pose_c.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-val'
  }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_a"
  top: "rgb_frames_a"
  hdf5_data_param {
    source: "examples/vgps/train_pose_a.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-train'
  }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_b"
  top: "rgb_frames_b"
  hdf5_data_param {
    source: "examples/vgps/train_pose_b.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-train'
  }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "position_c"
  top: "rgb_frames_c"
  hdf5_data_param {
    source: "examples/vgps/train_pose_c.txt"
    batch_size: 5
  }
  include: {
    phase: TEST
    stage: 'test-on-train'
  }
}

layers {
  name: "concat_frames"
  type: CONCAT
  bottom: "rgb_frames_a"
  bottom: "rgb_frames_b"
  bottom: "rgb_frames_c"
  top: "rgb_frames"
  concat_param {
    concat_dim: 0
  }
}
layers {
  name: "concat_position"
  type: CONCAT
  bottom: "position_a"
  bottom: "position_b"
  bottom: "position_c"
  top: "position"
  concat_param {
    concat_dim: 0
  }
}

layers {
  name: "lrn"
  type: LRN
  bottom: "rgb_frames"
  top: "lrn_frames"
  lrn_param {
    norm_region: WITHIN_CHANNEL
    alpha: 5e-05
    beta: 0.75
  }
}

# Image Processing Layers
layers {
  name: "conv1/7x7_s2"
  type: CONVOLUTION
  bottom: "lrn_frames"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 2
  weight_decay: 0
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
#layers {
#  name: "lrn2"
#  type: LRN
#  bottom: "conv1"
#  top: "conv1_lrn"
#  lrn_param {
#    norm_region: ACROSS_CHANNELS
#    alpha: 5e-05
#    beta: 0.75
#  }
#}


layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "conv1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 2
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "conv2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 2
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}
layers {
  name: "softmax"
  type: SOFTMAX
  bottom: "conv3"
  top: "conv3"
  softmax_param {
    engine: CAFFE
    temperature: 1.0
    dimension: "spatial"
  }
}
layers {
  name: "fc_images"
  type: INNER_PRODUCT
  bottom: "conv3"
  top: "expected_xy"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 0
  weight_decay: 0
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "imagexy"
      channels: 32
      width: 109
      height: 109
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layers {
  name: "fc1_smaller"
  type: INNER_PRODUCT
  bottom: "expected_xy"
  top: "image_features_smaller"
  blobs_lr: 5
  blobs_lr: 10
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 9
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "euc_distance"
  type: EUCLIDEAN_DISTANCE
  bottom: "image_features_smaller"
  bottom: "position"
  top: "average_distance"
  include: {phase: TEST}
}

layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "image_features_smaller"
  bottom: "position"
  top: "euclidean_error"
  loss_weight: 1
}


#layers {
#  name: "output_lrn"
#  type: HDF5_OUTPUT
#  hdf5_output_param {
#    file_name: "examples/vgps/data/lrn_output_exposure.h5"
#  }
#  bottom: "lrn_frames"
#  bottom: "rgb_frames"
#  include: {
#    phase: TEST
#  }
#}

